#제어문 : 프로그램에서 원하는 결과를 얻기 위해 흐름을 제어하는 명령문

'''
제어문의 종류
    1. 조건문 : 특정 조건을 세워, 해당 조건이 만족할 경우 명령을 실행하게 하는 문장
 (if문)
 
    2. 반복문 : 특정 조건을 세워, 해당 조건이 만족하는 동안 반복적으로 명령을 실행하게
 하는 문장 (while) 특정 객체 안의 값 만큼 반복적으로 명령을 실행하는 제한적인 반복문 (for문)

    3. 분기문(기타제어문) : 특정 시점에 특정 명령을 진행하는 문장 (break,pass,continue)

    if문의 형태

    if 조건식 :
        조건식의 결과가 참일 때 진행할 명령문
    elif 조건식 :
        if문이 참이 아니고 elif의 조건식이 참일 때 진행되는 명령
    else :
        위의 모든 조건식들이 참이 아닐 경우 진행할 명령


    while 조건식 :
        조건식이 만족할 동안 작성할 명령문

    while True :
        무한루프문
'''
